# DeletingBadFamElemError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..DeletingBadFamElemError Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Family contains invalid elements. They will be deleted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DeletingBadFamElemError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DeletingBadFamElemError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DeletingBadFamElemError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace